var devanagariMaps = { itrans: {
    // Vowels
    'अ': 'a', 'आ': 'A', 'इ': 'i', 'ई': 'I', 'उ': 'u', 'ऊ': 'U',
    'ऋ': 'ri', 'ॠ': 'ri', 'ऌ': 'li', 'ॡ': 'li',
    'ए': 'e', 'ऐ': 'ai', 'ऑ': 'o', 'ओ': 'o', 'औ': 'au',

    // Consonants
    'क': 'kₐ', 'ख': 'khₐ', 'ग': 'gₐ', 'घ': 'ghₐ', 'ङ': 'gnₐ',
    'च': 'chₐ', 'छ': 'Chₐ', 'ज': 'jₐ', 'झ': 'jhₐ', 'ञ': 'jnₐ',
    'ट': 'Tₐ', 'ठ': 'Thₐ', 'ड': 'Dₐ', 'ढ': 'Dhₐ', 'ण': 'Nₐ',
    'त': 'tₐ', 'थ': 'thₐ', 'द': 'dₐ', 'ध': 'dhₐ', 'न': 'nₐ',
    'प': 'pₐ', 'फ': 'phₐ', 'ब': 'bₐ', 'भ': 'bhₐ', 'म': 'mₐ',
    'य': 'yₐ', 'र': 'rₐ', 'ल': 'lₐ', 'व': 'vₐ', 'श': 'shₐ',
    'ष': 'Shₐ', 'स': 'sₐ', 'ह': 'hₐ', 'ळ': 'Lₐ',
    '\u091C\u093C': 'zₐ', '\u092B\u093C': 'fₐ', // ज़ फ़

    // nukta consonants
    'क़': 'qₐ', 'ख़': 'qhₐ', 'ग़': 'gₐ', 'ज़': 'zₐ', 'ड़': 'rₐ', 'ढ़': 'rhₐ', 'फ़': 'fₐ', 'य़': 'yyₐ',

    // Conjunct Consonants (Special Cases)
    '\u0915\u094D\u0937': 'kshₐ', // क्ष
    '\u091C\u094D\u091E': 'gyₐ', // ज्ञ

    // Matras (Vowel signs)
    'ा': 'A', 'ि': 'i', 'ी': 'I', 'ु': 'u', 'ू': 'U',
    'े': 'e', 'ै': 'ai', 'ो': 'o', 'ौ': 'au', 'ृ': 'ri',
    'ॄ': 'ri', 'ॢ': 'li', 'ॣ': 'li',

    // Additional marks
    '्': '', 'ं': 'ⁿ', 'ः': 'H', 'ँ': 'ⁿ',
    '़': '', // Nukta
    'ऽ': "'", // Avagraha
    'ॅ': 'e', 'ॉ': 'o',

    // Numerals
    '०': '0', '१': '1', '२': '2', '३': '3', '४': '4',
    '५': '5', '६': '6', '७': '7', '८': '8', '९': '9',

    // Others
    '।': '. ', '॥': '. ',
    ' ': ' '

    // we don't remap ॐ because this is interepreted as a religious symbol, and not part of any word
}, iso: {}, ipa: {} };
