var kannadaMaps = { itrans: {
    // Vowels
    'ಅ': 'a', 'ಆ': 'A', 'ಇ': 'i', 'ಈ': 'I', 'ಉ': 'u', 'ಊ': 'U',
    'ಋ': 'ri', 'ೠ': 'ri', 'ಌ': 'li', 'ೡ': 'li', 'ಎ': 'e', 'ಏ': 'E', 'ಐ': 'ai', 'ಒ': 'o', 'ಓ': 'O', 'ಔ': 'au',

    // Consonants
    'ಕ': 'ka', 'ಖ': 'kha', 'ಗ': 'ga', 'ಘ': 'gha', 'ಙ': 'gna',
    'ಚ': 'cha', 'ಛ': 'Cha', 'ಜ': 'ja', 'ಝ': 'jha', 'ಞ': 'jna',
    'ಟ': 'Ta', 'ಠ': 'Tha', 'ಡ': 'Da', 'ಢ': 'Dha', 'ಣ': 'Na',
    'ತ': 'ta', 'ಥ': 'tha', 'ದ': 'da', 'ಧ': 'dha', 'ನ': 'na',
    'ಪ': 'pa', 'ಫ': 'pha', 'ಬ': 'ba', 'ಭ': 'bha', 'ಮ': 'ma',
    'ಯ': 'ya', 'ರ': 'ra', 'ಲ': 'la', 'ವ': 'va', 'ಶ': 'sha',
    'ಷ': 'Sha', 'ಸ': 'sa', 'ಹ': 'ha', 'ಳ': 'La', 'ೞ': 'LLa',

    // Matras (Vowel signs)
    'ಾ': 'A', 'ಿ': 'i', 'ೀ': 'I', 'ು': 'u', 'ೂ': 'U',
    'ೆ': 'e', 'ೇ': 'E', 'ೈ': 'ai', 'ೊ': 'o', 'ೋ': 'O', 'ೌ': 'au', 'ೃ': 'ru', 'ೄ': 'ri',
    'ೢ': 'li', 'ೣ': 'li',

    // Additional marks
    '್': '', 'ಂ': 'ⁿ', 'ಃ': 'H', 'ಁ': 'ⁿ', '\u0C80': 'ⁿ', 'ಽ': '\'', 'ೕ': '', 'ೖ': '', 'ೱ': 'H', 'ೲ': 'f', // jihvamuliya (velar fricative), upadhmaniya (bilabial fricative)
    'ಱ': 'fa', // old Kannada letter FA

    // Numerals
    '೦': '0', '೧': '1', '೨': '2', '೩': '3', '೪': '4',
    '೫': '5', '೬': '6', '೭': '7', '೮': '8', '೯': '9',

    // Others
    '।': '. ', '॥': '. ',
    ' ': ' '
}, iso: {}, ipa: {} };
