var teluguMaps = { itrans: {
    // Vowels
    'అ': 'a', 'ఆ': 'A', 'ఇ': 'i', 'ఈ': 'I', 'ఉ': 'u', 'ఊ': 'U',
    'ఋ': 'ri', 'ౠ': 'ri', 'ఌ': 'li', 'ౡ': 'li', 'ఎ': 'e', 'ఏ': 'E', 'ఐ': 'ai', 'ఒ': 'o', 'ఓ': 'O', 'ఔ': 'au',

    // Chandrabindu, avagraha
    'ఁ': 'ⁿ', 'ఽ': "'",

    // Consonants
    'క': 'ka', 'ఖ': 'kha', 'గ': 'ga', 'ఘ': 'gha', 'ఙ': 'gna',
    'చ': 'cha', 'ఛ': 'Cha', 'జ': 'ja', 'ఝ': 'jha', 'ఞ': 'jna',
    'ట': 'Ta', 'ఠ': 'Tha', 'డ': 'Da', 'ఢ': 'Dha', 'ణ': 'Na',
    'త': 'ta', 'థ': 'tha', 'ద': 'da', 'ధ': 'dha', 'న': 'na',
    'ప': 'pa', 'ఫ': 'pha', 'బ': 'ba', 'భ': 'bha', 'మ': 'ma',
    'య': 'ya', 'ర': 'ra', 'ల': 'la', 'వ': 'va', 'శ': 'sha',
    'ష': 'Sha', 'స': 'sa', 'హ': 'ha', 'ళ': 'La', 'ఱ': 'rra', 'ఴ': 'LLLa', '\u0C15\u0C4D\u0C37': 'kSha', // క్ష
    'ౘ': 'tsa', 'ౙ': 'dza', 'ౚ': 'rra', 'ౝ': 'na',

    // Matras (Vowel signs)
    'ా': 'A', 'ి': 'i', 'ీ': 'I', 'ు': 'u', 'ూ': 'U',
    'ృ': 'ri', 'ౄ': 'ri',
    'ె': 'e', 'ే': 'E', 'ై': 'ai', 'ొ': 'o', 'ో': 'O', 'ౌ': 'au',
    'ౢ': 'li', 'ౣ': 'li',

    // Additional marks
    '్': '', 'ం': 'ᵐ', 'ః': 'H',

    // Numerals
    '౦': '0', '౧': '1', '౨': '2', '౩': '3', '౪': '4',
    '౫': '5', '౬': '6', '౭': '7', '౮': '8', '౯': '9',

    // Fractions
    '౸': ' 0', '౹': '¼', '౺': '½', '౻': '¾',
    '౼': ' 1/16', '౽': '⅛', '౾': ' 3/16',

    // Others
    '।': '. ', '॥': '. ',
    ' ': ' '
}, iso: {}, ipa: {} };
